## SQL - String Function 
    String functions are used to ::
    - Manipulate text data
    - Clean messy columns
    - Extract meaningful information
    - Format output for reports
    They work on CHAR, VARCHAR, TEXT data types.

### Common string function 
    |      Function / Method       |                     Description                            |
    | ---------------------------- | ---------------------------------------------------------- |
    |  UPPER()                     | Converts all characters in a string to uppercase           |
    |  LOWER()                     | Converts all characters in a string to lowercase           |
    |  LENGTH()  /  CHAR_LENGTH()  | Returns the number of characters in a string               |
    |  TRIM()                      | Removes spaces from both the beginning and end of a string |
    |  SUBSTRING()  /  SUBSTR()    | Extracts a specific part of a string                       |
    |  LEFT()                      | Extracts a given number of characters from the left side   |
    |  RIGHT()                     | Extracts a given number of characters from the right side  |
    |  CONCAT()                    | Combines two or more strings into one                      |
    |  REPLACE()                   | Replaces a substring with another substring                |
    |  POSITION()  /  INSTR()      | Finds the position of a substring within a string          |
    |  LIKE                        | Performs pattern matching on strings                       |
    |  REVERSE()                   | Reverses the characters in a string                        |

### Database Connection

In [68]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:@localhost/test

In [70]:
%%sql
SELECT version();

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[('10.4.32-MariaDB',)]

### Using table employees

In [73]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10), 'amit@gmail.com'),
 (102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15), 'neha@yahoo.com'),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20), 'rahul@gmail.com'),
 (104, 'Sneha', 'Finance', 50000, 26, 'Delhi', datetime.date(2022, 11, 5), 'priya@outlook.com'),
 (105, 'Vikas', 'HR', 40000, 35, 'Mumbai', datetime.date(2019, 8, 12), 'ankit@gmail.com'),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25), 'rohit@gmail.com'),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18), 'kavya@yahoo.com')]

### Convert all employee names to uppercase

In [17]:
%%sql
SELECT UPPER(emp_name) as Upper_case FROM employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('AMIT',),
 ('NEHA',),
 ('RAHUL',),
 ('SNEHA',),
 ('VIKAS',),
 ('PRIYA',),
 ('ARJUN',)]

### Find length of each employee name

In [19]:
%%sql
select emp_name, length(emp_name) as name_length from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Amit', 4),
 ('Neha', 4),
 ('Rahul', 5),
 ('Sneha', 5),
 ('Vikas', 5),
 ('Priya', 5),
 ('Arjun', 5)]

### Extract first 4 characters of emp_name

In [24]:
%%sql
select emp_name, substring(emp_name, 1,4) from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Amit', 'Amit'),
 ('Neha', 'Neha'),
 ('Rahul', 'Rahu'),
 ('Sneha', 'Sneh'),
 ('Vikas', 'Vika'),
 ('Priya', 'Priy'),
 ('Arjun', 'Arju')]

### Show full detail with full name as emp_name (department)

In [27]:
%%sql
SELECT CONCAT(emp_name, ' (', department, ')') AS emp_details
FROM employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Amit (IT)',),
 ('Neha (HR)',),
 ('Rahul (IT)',),
 ('Sneha (Finance)',),
 ('Vikas (HR)',),
 ('Priya (IT)',),
 ('Arjun (Finance)',)]

### Find employees whose email is Gmail

In [46]:
%%sql
select emp_name, email
from employees
where email like '%@gmail.com';

 * mysql+pymysql://root:***@localhost/test
4 rows affected.

[('Amit', 'amit@gmail.com'),
 ('Rahul', 'rahul@gmail.com'),
 ('Vikas', 'ankit@gmail.com'),
 ('Priya', 'rohit@gmail.com')]

### Replace city name Delhi with New Delhi

In [53]:
%%sql
select emp_name, replace(city,'Delhi','New Delhi') as new_city from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Amit', 'Pune'),
 ('Neha', 'Mumbai'),
 ('Rahul', 'Pune'),
 ('Sneha', 'New Delhi'),
 ('Vikas', 'Mumbai'),
 ('Priya', 'Bangalore'),
 ('Arjun', 'Pune')]

### Show email username (before @)

In [77]:
%%sql
select substring(email, 1, position('@' in email)-1) as username 
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('amit',),
 ('neha',),
 ('rahul',),
 ('priya',),
 ('ankit',),
 ('rohit',),
 ('kavya',)]

### Find employees whose name starts with A

In [84]:
%%sql
select * from employees
where emp_name like 'A%';

 * mysql+pymysql://root:***@localhost/test
2 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10), 'amit@gmail.com'),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18), 'kavya@yahoo.com')]

### Remove extra spaces from employee names

In [87]:
%%sql
SELECT TRIM(emp_name) FROM employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Amit',),
 ('Neha',),
 ('Rahul',),
 ('Sneha',),
 ('Vikas',),
 ('Priya',),
 ('Arjun',)]

### Reverse employee names

In [90]:
%%sql
SELECT emp_name, REVERSE(emp_name) FROM employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Amit', 'timA'),
 ('Neha', 'aheN'),
 ('Rahul', 'luhaR'),
 ('Sneha', 'ahenS'),
 ('Vikas', 'sakiV'),
 ('Priya', 'ayirP'),
 ('Arjun', 'nujrA')]